app/controllers/api/v1/greetings_controller.rb

  def set_greeting
    @greeting = Greeting.find(params[:id])
---
SELECT "greetings".* FROM "greetings" WHERE "greetings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]