app/controllers/api/v1/greetings_controller.rb

  def index
    @greetings = Greeting.all.sample
---
SELECT "greetings".* FROM "greetings" ORDER BY "greetings"."id" DESC

  def set_greeting
    @greeting = Greeting.find(params[:id])
---
SELECT "greetings".* FROM "greetings" WHERE "greetings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]